org/articles/linux/2012-12-05-cygwin-install-jekyll.org
#+begin_html
---
date: 2012-12-05
template: tech.jade
title: cygwin 下安装jekyll
category: Linux
change_frequency: monthly
---
#+end_html


Windows 下cygwin可以模拟Linux环境.于是打算用cygwin+jekyll 来作写博客的环境.

安装jekyll在cygwin下面没有在linux下那样顺利，下面记录下我的安装过程:

1. 从cygwin安装基础软件

   cygwin安装时候选择安装ruby,rake,gcc4,gcc4-g++,make,git,openssh等开发工具安上.

   安装上工具之后,gem 工具就安装好了.
2. 通过gem 安装jekyll环境  
   首先安装 rake-compiler:
   #+begin_src sh
        gem install rake-compiler   
   #+end_src

   安装posix-spawn这个库，gem自带的有问题，需要从github上安装:
     #+begin_src sh
        git clone git://github.com/rtomayko/posix-spawn.git
        cd posix-spawn
        rake gem #此处用到了rake-compiler
        gem install pkg/posix-spwan-0.3.6
     #+end_src

   安装好posix-spawn这个库后，安装jekyll:
    #+begin_src sh
        gem install jekyll    
    #+end_src
   jekyll就可以使用了:)

